{"swagger":"2.0","info":{"version":"1.0.0","title":"Microsoft Graph","description":"Connectors to Intune. Used for capturing data from devices (in Intune)"},"host":"graph.microsoft.com","basePath":"/","schemes":["https"],"consumes":[],"produces":["application/json"],"paths":{"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D/users":{},"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D/microsoft.graph.syncDevice":{},"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D/deviceHealthScriptStates":{},"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D/deviceCompliancePolicyStates":{},"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D/detectedApps":{},"/beta/deviceManagement/managedDevices":{"get":{"summary":"List Managed Devices","description":"List Managed Devices","operationId":"ListManagedDevices","parameters":[{"name":"filter","in":"query","required":false,"type":"string","x-ms-visibility":"important","description":"example: deviceName eq 'w11-1c'"},{"name":"Content-type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"@odata.count":{"type":"integer","format":"int32","description":"@odata.count"},"value":{"type":"array","items":{"type":"object","properties":{"id":{"type":"string","description":"id"},"userId":{"type":"string","description":"userId"},"deviceName":{"type":"string","description":"deviceName"},"ownerType":{"type":"string","description":"ownerType"},"managedDeviceOwnerType":{"type":"string","description":"managedDeviceOwnerType"},"managementState":{"type":"string","description":"managementState"},"enrolledDateTime":{"type":"string","description":"enrolledDateTime"},"lastSyncDateTime":{"type":"string","description":"lastSyncDateTime"},"chassisType":{"type":"string","description":"chassisType"},"operatingSystem":{"type":"string","description":"operatingSystem"},"deviceType":{"type":"string","description":"deviceType"},"complianceState":{"type":"string","description":"complianceState"},"jailBroken":{"type":"string","description":"jailBroken"},"managementAgent":{"type":"string","description":"managementAgent"},"osVersion":{"type":"string","description":"osVersion"},"easActivated":{"type":"boolean","description":"easActivated"},"easDeviceId":{"type":"string","description":"easDeviceId"},"easActivationDateTime":{"type":"string","description":"easActivationDateTime"},"aadRegistered":{"type":"boolean","description":"aadRegistered"},"azureADRegistered":{"type":"boolean","description":"azureADRegistered"},"deviceEnrollmentType":{"type":"string","description":"deviceEnrollmentType"},"lostModeState":{"type":"string","description":"lostModeState"},"activationLockBypassCode":{"type":"string","description":"activationLockBypassCode"},"emailAddress":{"type":"string","description":"emailAddress"},"azureActiveDirectoryDeviceId":{"type":"string","description":"azureActiveDirectoryDeviceId"},"azureADDeviceId":{"type":"string","description":"azureADDeviceId"},"deviceRegistrationState":{"type":"string","description":"deviceRegistrationState"},"deviceCategoryDisplayName":{"type":"string","description":"deviceCategoryDisplayName"},"isSupervised":{"type":"boolean","description":"isSupervised"},"exchangeLastSuccessfulSyncDateTime":{"type":"string","description":"exchangeLastSuccessfulSyncDateTime"},"exchangeAccessState":{"type":"string","description":"exchangeAccessState"},"exchangeAccessStateReason":{"type":"string","description":"exchangeAccessStateReason"},"remoteAssistanceSessionUrl":{"type":"string","description":"remoteAssistanceSessionUrl"},"remoteAssistanceSessionErrorDetails":{"type":"string","description":"remoteAssistanceSessionErrorDetails"},"isEncrypted":{"type":"boolean","description":"isEncrypted"},"userPrincipalName":{"type":"string","description":"userPrincipalName"},"enrolledByUserPrincipalName":{"type":"string","description":"enrolledByUserPrincipalName"},"model":{"type":"string","description":"model"},"manufacturer":{"type":"string","description":"manufacturer"},"imei":{"type":"string","description":"imei"},"complianceGracePeriodExpirationDateTime":{"type":"string","description":"complianceGracePeriodExpirationDateTime"},"serialNumber":{"type":"string","description":"serialNumber"},"phoneNumber":{"type":"string","description":"phoneNumber"},"androidSecurityPatchLevel":{"type":"string","description":"androidSecurityPatchLevel"},"userDisplayName":{"type":"string","description":"userDisplayName"},"configurationManagerClientEnabledFeatures":{"type":"string","description":"configurationManagerClientEnabledFeatures"},"wiFiMacAddress":{"type":"string","description":"wiFiMacAddress"},"deviceHealthAttestationState":{"type":"string","description":"deviceHealthAttestationState"},"subscriberCarrier":{"type":"string","description":"subscriberCarrier"},"meid":{"type":"string","description":"meid"},"totalStorageSpaceInBytes":{"type":"integer","format":"int32","description":"totalStorageSpaceInBytes"},"freeStorageSpaceInBytes":{"type":"integer","format":"int32","description":"freeStorageSpaceInBytes"},"managedDeviceName":{"type":"string","description":"managedDeviceName"},"partnerReportedThreatState":{"type":"string","description":"partnerReportedThreatState"},"retireAfterDateTime":{"type":"string","description":"retireAfterDateTime"},"preferMdmOverGroupPolicyAppliedDateTime":{"type":"string","description":"preferMdmOverGroupPolicyAppliedDateTime"},"autopilotEnrolled":{"type":"boolean","description":"autopilotEnrolled"},"requireUserEnrollmentApproval":{"type":"string","description":"requireUserEnrollmentApproval"},"managementCertificateExpirationDate":{"type":"string","description":"managementCertificateExpirationDate"},"iccid":{"type":"string","description":"iccid"},"udid":{"type":"string","description":"udid"},"roleScopeTagIds":{"type":"array","items":{},"description":"roleScopeTagIds"},"windowsActiveMalwareCount":{"type":"integer","format":"int32","description":"windowsActiveMalwareCount"},"windowsRemediatedMalwareCount":{"type":"integer","format":"int32","description":"windowsRemediatedMalwareCount"},"notes":{"type":"string","description":"notes"},"configurationManagerClientHealthState":{"type":"string","description":"configurationManagerClientHealthState"},"configurationManagerClientInformation":{"type":"string","description":"configurationManagerClientInformation"},"ethernetMacAddress":{"type":"string","description":"ethernetMacAddress"},"physicalMemoryInBytes":{"type":"integer","format":"int32","description":"physicalMemoryInBytes"},"processorArchitecture":{"type":"string","description":"processorArchitecture"},"specificationVersion":{"type":"string","description":"specificationVersion"},"joinType":{"type":"string","description":"joinType"},"skuFamily":{"type":"string","description":"skuFamily"},"securityPatchLevel":{"type":"string","description":"securityPatchLevel"},"skuNumber":{"type":"integer","format":"int32","description":"skuNumber"},"managementFeatures":{"type":"string","description":"managementFeatures"},"enrollmentProfileName":{"type":"string","description":"enrollmentProfileName"},"bootstrapTokenEscrowed":{"type":"boolean","description":"bootstrapTokenEscrowed"},"deviceFirmwareConfigurationInterfaceManaged":{"type":"boolean","description":"deviceFirmwareConfigurationInterfaceManaged"},"deviceIdentityAttestationDetail":{"type":"string","description":"deviceIdentityAttestationDetail"},"hardwareInformation":{"type":"object","properties":{"serialNumber":{"type":"string","description":"serialNumber"},"totalStorageSpace":{"type":"integer","format":"int32","description":"totalStorageSpace"},"freeStorageSpace":{"type":"integer","format":"int32","description":"freeStorageSpace"},"imei":{"type":"string","description":"imei"},"meid":{"type":"string","description":"meid"},"manufacturer":{"type":"string","description":"manufacturer"},"model":{"type":"string","description":"model"},"phoneNumber":{"type":"string","description":"phoneNumber"},"subscriberCarrier":{"type":"string","description":"subscriberCarrier"},"cellularTechnology":{"type":"string","description":"cellularTechnology"},"wifiMac":{"type":"string","description":"wifiMac"},"operatingSystemLanguage":{"type":"string","description":"operatingSystemLanguage"},"isSupervised":{"type":"boolean","description":"isSupervised"},"isEncrypted":{"type":"boolean","description":"isEncrypted"},"batterySerialNumber":{"type":"string","description":"batterySerialNumber"},"batteryHealthPercentage":{"type":"integer","format":"int32","description":"batteryHealthPercentage"},"batteryChargeCycles":{"type":"integer","format":"int32","description":"batteryChargeCycles"},"isSharedDevice":{"type":"boolean","description":"isSharedDevice"},"tpmSpecificationVersion":{"type":"string","description":"tpmSpecificationVersion"},"operatingSystemEdition":{"type":"string","description":"operatingSystemEdition"},"deviceFullQualifiedDomainName":{"type":"string","description":"deviceFullQualifiedDomainName"},"deviceGuardVirtualizationBasedSecurityHardwareRequirementState":{"type":"string","description":"deviceGuardVirtualizationBasedSecurityHardwareRequirementState"},"deviceGuardVirtualizationBasedSecurityState":{"type":"string","description":"deviceGuardVirtualizationBasedSecurityState"},"deviceGuardLocalSystemAuthorityCredentialGuardState":{"type":"string","description":"deviceGuardLocalSystemAuthorityCredentialGuardState"},"osBuildNumber":{"type":"string","description":"osBuildNumber"},"operatingSystemProductType":{"type":"integer","format":"int32","description":"operatingSystemProductType"},"ipAddressV4":{"type":"string","description":"ipAddressV4"},"subnetAddress":{"type":"string","description":"subnetAddress"},"esimIdentifier":{"type":"string","description":"esimIdentifier"},"systemManagementBIOSVersion":{"type":"string","description":"systemManagementBIOSVersion"},"tpmManufacturer":{"type":"string","description":"tpmManufacturer"},"tpmVersion":{"type":"string","description":"tpmVersion"},"wiredIPv4Addresses":{"type":"array","items":{},"description":"wiredIPv4Addresses"},"batteryLevelPercentage":{"type":"string","description":"batteryLevelPercentage"},"residentUsersCount":{"type":"string","description":"residentUsersCount"},"productName":{"type":"string","description":"productName"},"deviceLicensingStatus":{"type":"string","description":"deviceLicensingStatus"},"deviceLicensingLastErrorCode":{"type":"integer","format":"int32","description":"deviceLicensingLastErrorCode"},"deviceLicensingLastErrorDescription":{"type":"string","description":"deviceLicensingLastErrorDescription"},"sharedDeviceCachedUsers":{"type":"array","items":{},"description":"sharedDeviceCachedUsers"}},"description":"hardwareInformation"},"deviceActionResults":{"type":"array","items":{},"description":"deviceActionResults"},"usersLoggedOn":{"type":"array","items":{"type":"object","properties":{"userId":{"type":"string","description":"userId"},"lastLogOnDateTime":{"type":"string","description":"lastLogOnDateTime"}}},"description":"usersLoggedOn"},"chromeOSDeviceInfo":{"type":"array","items":{},"description":"chromeOSDeviceInfo"},"supplementalDeviceDetails":{"type":"array","items":{},"description":"supplementalDeviceDetails"}}},"description":"value"}}}}},"x-ms-visibility":"important"}},"/beta/deviceManagement/managedDevices/%7B%7BmanagedDevice-id%7D%7D":{},"/beta/deviceManagement/managedDevices/{managedDevice-id}/users":{"get":{"summary":"List Users for a Device","description":"List Users for a Device","operationId":"ListUsersForADevice","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"value":{"type":"array","items":{"type":"object","properties":{"id":{"type":"string","description":"id"},"deletedDateTime":{"type":"string","description":"deletedDateTime"},"accountEnabled":{"type":"boolean","description":"accountEnabled"},"ageGroup":{"type":"string","description":"ageGroup"},"businessPhones":{"type":"array","items":{},"description":"businessPhones"},"city":{"type":"string","description":"city"},"createdDateTime":{"type":"string","description":"createdDateTime"},"creationType":{"type":"string","description":"creationType"},"companyName":{"type":"string","description":"companyName"},"consentProvidedForMinor":{"type":"string","description":"consentProvidedForMinor"},"country":{"type":"string","description":"country"},"department":{"type":"string","description":"department"},"displayName":{"type":"string","description":"displayName"},"employeeId":{"type":"string","description":"employeeId"},"employeeHireDate":{"type":"string","description":"employeeHireDate"},"employeeLeaveDateTime":{"type":"string","description":"employeeLeaveDateTime"},"employeeType":{"type":"string","description":"employeeType"},"faxNumber":{"type":"string","description":"faxNumber"},"givenName":{"type":"string","description":"givenName"},"imAddresses":{"type":"array","items":{},"description":"imAddresses"},"infoCatalogs":{"type":"array","items":{},"description":"infoCatalogs"},"isLicenseReconciliationNeeded":{"type":"boolean","description":"isLicenseReconciliationNeeded"},"isManagementRestricted":{"type":"string","description":"isManagementRestricted"},"isResourceAccount":{"type":"string","description":"isResourceAccount"},"jobTitle":{"type":"string","description":"jobTitle"},"legalAgeGroupClassification":{"type":"string","description":"legalAgeGroupClassification"},"mail":{"type":"string","description":"mail"},"mailNickname":{"type":"string","description":"mailNickname"},"mobilePhone":{"type":"string","description":"mobilePhone"},"onPremisesDistinguishedName":{"type":"string","description":"onPremisesDistinguishedName"},"officeLocation":{"type":"string","description":"officeLocation"},"onPremisesDomainName":{"type":"string","description":"onPremisesDomainName"},"onPremisesImmutableId":{"type":"string","description":"onPremisesImmutableId"},"onPremisesLastSyncDateTime":{"type":"string","description":"onPremisesLastSyncDateTime"},"onPremisesObjectIdentifier":{"type":"string","description":"onPremisesObjectIdentifier"},"onPremisesSecurityIdentifier":{"type":"string","description":"onPremisesSecurityIdentifier"},"onPremisesSamAccountName":{"type":"string","description":"onPremisesSamAccountName"},"onPremisesSyncEnabled":{"type":"string","description":"onPremisesSyncEnabled"},"onPremisesUserPrincipalName":{"type":"string","description":"onPremisesUserPrincipalName"},"otherMails":{"type":"array","items":{},"description":"otherMails"},"passwordPolicies":{"type":"string","description":"passwordPolicies"},"postalCode":{"type":"string","description":"postalCode"},"preferredDataLocation":{"type":"string","description":"preferredDataLocation"},"preferredLanguage":{"type":"string","description":"preferredLanguage"},"proxyAddresses":{"type":"array","items":{},"description":"proxyAddresses"},"refreshTokensValidFromDateTime":{"type":"string","description":"refreshTokensValidFromDateTime"},"securityIdentifier":{"type":"string","description":"securityIdentifier"},"showInAddressList":{"type":"string","description":"showInAddressList"},"signInSessionsValidFromDateTime":{"type":"string","description":"signInSessionsValidFromDateTime"},"state":{"type":"string","description":"state"},"streetAddress":{"type":"string","description":"streetAddress"},"surname":{"type":"string","description":"surname"},"usageLocation":{"type":"string","description":"usageLocation"},"userPrincipalName":{"type":"string","description":"userPrincipalName"},"externalUserConvertedOn":{"type":"string","description":"externalUserConvertedOn"},"externalUserState":{"type":"string","description":"externalUserState"},"externalUserStateChangeDateTime":{"type":"string","description":"externalUserStateChangeDateTime"},"userType":{"type":"string","description":"userType"},"employeeOrgData":{"type":"string","description":"employeeOrgData"},"passwordProfile":{"type":"string","description":"passwordProfile"},"assignedLicenses":{"type":"array","items":{"type":"object","properties":{"disabledPlans":{"type":"array","items":{},"description":"disabledPlans"},"skuId":{"type":"string","description":"skuId"}}},"description":"assignedLicenses"},"assignedPlans":{"type":"array","items":{"type":"object","properties":{"assignedDateTime":{"type":"string","description":"assignedDateTime"},"capabilityStatus":{"type":"string","description":"capabilityStatus"},"service":{"type":"string","description":"service"},"servicePlanId":{"type":"string","description":"servicePlanId"}}},"description":"assignedPlans"},"authorizationInfo":{"type":"object","properties":{"certificateUserIds":{"type":"array","items":{},"description":"certificateUserIds"}},"description":"authorizationInfo"},"cloudRealtimeCommunicationInfo":{"type":"object","properties":{"isSipEnabled":{"type":"string","description":"isSipEnabled"}},"description":"cloudRealtimeCommunicationInfo"},"deviceKeys":{"type":"array","items":{},"description":"deviceKeys"},"identities":{"type":"array","items":{"type":"object","properties":{"signInType":{"type":"string","description":"signInType"},"issuer":{"type":"string","description":"issuer"},"issuerAssignedId":{"type":"string","description":"issuerAssignedId"}}},"description":"identities"},"onPremisesExtensionAttributes":{"type":"object","properties":{"extensionAttribute1":{"type":"string","description":"extensionAttribute1"},"extensionAttribute2":{"type":"string","description":"extensionAttribute2"},"extensionAttribute3":{"type":"string","description":"extensionAttribute3"},"extensionAttribute4":{"type":"string","description":"extensionAttribute4"},"extensionAttribute5":{"type":"string","description":"extensionAttribute5"},"extensionAttribute6":{"type":"string","description":"extensionAttribute6"},"extensionAttribute7":{"type":"string","description":"extensionAttribute7"},"extensionAttribute8":{"type":"string","description":"extensionAttribute8"},"extensionAttribute9":{"type":"string","description":"extensionAttribute9"},"extensionAttribute10":{"type":"string","description":"extensionAttribute10"},"extensionAttribute11":{"type":"string","description":"extensionAttribute11"},"extensionAttribute12":{"type":"string","description":"extensionAttribute12"},"extensionAttribute13":{"type":"string","description":"extensionAttribute13"},"extensionAttribute14":{"type":"string","description":"extensionAttribute14"},"extensionAttribute15":{"type":"string","description":"extensionAttribute15"}},"description":"onPremisesExtensionAttributes"},"onPremisesProvisioningErrors":{"type":"array","items":{},"description":"onPremisesProvisioningErrors"},"onPremisesSipInfo":{"type":"object","properties":{"isSipEnabled":{"type":"boolean","description":"isSipEnabled"},"sipDeploymentLocation":{"type":"string","description":"sipDeploymentLocation"},"sipPrimaryAddress":{"type":"string","description":"sipPrimaryAddress"}},"description":"onPremisesSipInfo"},"provisionedPlans":{"type":"array","items":{},"description":"provisionedPlans"},"serviceProvisioningErrors":{"type":"array","items":{},"description":"serviceProvisioningErrors"}}},"description":"value"}}}}}}},"/beta/deviceManagement/managedDevices/{managedDevice-id}/microsoft.graph.syncDevice":{"post":{"summary":"Sync Device","description":"Sync Device","operationId":"SyncDevice","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"204":{"description":"204","schema":{}}}}},"/beta/deviceManagement/managedDevices/{managedDevice-id}/deviceHealthScriptStates":{"get":{"summary":"List Device Health Script States","description":"List Device Health Script States","operationId":"ListDeviceHealthScriptStates","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"@odata.count":{"type":"integer","format":"int32","description":"@odata.count"},"value":{"type":"array","items":{},"description":"value"}}}}}}},"/beta/deviceManagement/managedDevices/{managedDevice-id}/deviceCompliancePolicyStates":{"get":{"summary":"Get Device Compliance Policy States","description":"Get Device Compliance Policy States","operationId":"GetDeviceCompliancePolicyStates","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"value":{"type":"array","items":{"type":"object","properties":{"id":{"type":"string","description":"id"},"displayName":{"type":"string","description":"displayName"},"version":{"type":"integer","format":"int32","description":"version"},"platformType":{"type":"string","description":"platformType"},"state":{"type":"string","description":"state"},"settingCount":{"type":"integer","format":"int32","description":"settingCount"},"userId":{"type":"string","description":"userId"},"userPrincipalName":{"type":"string","description":"userPrincipalName"},"settingStates":{"type":"array","items":{},"description":"settingStates"}}},"description":"value"}}}}}}},"/beta/deviceManagement/managedDevices/{managedDevice-id}/detectedApps":{"get":{"summary":"List Detected Apps on Corporate Owned Devices","description":"List Detected Apps on Corporate Owned Devices","operationId":"ListDetectedAppsOnCorporateOwnedDevices","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"@odata.count":{"type":"integer","format":"int32","description":"@odata.count"},"value":{"type":"array","items":{"type":"object","properties":{"id":{"type":"string","description":"id"},"displayName":{"type":"string","description":"displayName"},"version":{"type":"string","description":"version"},"sizeInByte":{"type":"integer","format":"int32","description":"sizeInByte"},"deviceCount":{"type":"integer","format":"int32","description":"deviceCount"},"publisher":{"type":"string","description":"publisher"},"platform":{"type":"string","description":"platform"}}},"description":"value"}}}}}}},"/beta/deviceManagement/managedDevices/{managedDevice-id}":{"get":{"summary":"Get Managed Device","description":"Get Managed Device","operationId":"GetManagedDevice","parameters":[{"name":"managedDevice-id","in":"path","required":true,"type":"string"},{"name":"Content-Type","in":"header","required":false,"type":"string"}],"responses":{"200":{"description":"200","schema":{"type":"object","properties":{"@odata.context":{"type":"string","description":"@odata.context"},"id":{"type":"string","description":"id"},"userId":{"type":"string","description":"userId"},"deviceName":{"type":"string","description":"deviceName"},"ownerType":{"type":"string","description":"ownerType"},"managedDeviceOwnerType":{"type":"string","description":"managedDeviceOwnerType"},"managementState":{"type":"string","description":"managementState"},"enrolledDateTime":{"type":"string","description":"enrolledDateTime"},"lastSyncDateTime":{"type":"string","description":"lastSyncDateTime"},"chassisType":{"type":"string","description":"chassisType"},"operatingSystem":{"type":"string","description":"operatingSystem"},"deviceType":{"type":"string","description":"deviceType"},"complianceState":{"type":"string","description":"complianceState"},"jailBroken":{"type":"string","description":"jailBroken"},"managementAgent":{"type":"string","description":"managementAgent"},"osVersion":{"type":"string","description":"osVersion"},"easActivated":{"type":"boolean","description":"easActivated"},"easDeviceId":{"type":"string","description":"easDeviceId"},"easActivationDateTime":{"type":"string","description":"easActivationDateTime"},"aadRegistered":{"type":"boolean","description":"aadRegistered"},"azureADRegistered":{"type":"boolean","description":"azureADRegistered"},"deviceEnrollmentType":{"type":"string","description":"deviceEnrollmentType"},"lostModeState":{"type":"string","description":"lostModeState"},"activationLockBypassCode":{"type":"string","description":"activationLockBypassCode"},"emailAddress":{"type":"string","description":"emailAddress"},"azureActiveDirectoryDeviceId":{"type":"string","description":"azureActiveDirectoryDeviceId"},"azureADDeviceId":{"type":"string","description":"azureADDeviceId"},"deviceRegistrationState":{"type":"string","description":"deviceRegistrationState"},"deviceCategoryDisplayName":{"type":"string","description":"deviceCategoryDisplayName"},"isSupervised":{"type":"boolean","description":"isSupervised"},"exchangeLastSuccessfulSyncDateTime":{"type":"string","description":"exchangeLastSuccessfulSyncDateTime"},"exchangeAccessState":{"type":"string","description":"exchangeAccessState"},"exchangeAccessStateReason":{"type":"string","description":"exchangeAccessStateReason"},"remoteAssistanceSessionUrl":{"type":"string","description":"remoteAssistanceSessionUrl"},"remoteAssistanceSessionErrorDetails":{"type":"string","description":"remoteAssistanceSessionErrorDetails"},"isEncrypted":{"type":"boolean","description":"isEncrypted"},"userPrincipalName":{"type":"string","description":"userPrincipalName"},"enrolledByUserPrincipalName":{"type":"string","description":"enrolledByUserPrincipalName"},"model":{"type":"string","description":"model"},"manufacturer":{"type":"string","description":"manufacturer"},"imei":{"type":"string","description":"imei"},"complianceGracePeriodExpirationDateTime":{"type":"string","description":"complianceGracePeriodExpirationDateTime"},"serialNumber":{"type":"string","description":"serialNumber"},"phoneNumber":{"type":"string","description":"phoneNumber"},"androidSecurityPatchLevel":{"type":"string","description":"androidSecurityPatchLevel"},"userDisplayName":{"type":"string","description":"userDisplayName"},"configurationManagerClientEnabledFeatures":{"type":"string","description":"configurationManagerClientEnabledFeatures"},"wiFiMacAddress":{"type":"string","description":"wiFiMacAddress"},"deviceHealthAttestationState":{"type":"string","description":"deviceHealthAttestationState"},"subscriberCarrier":{"type":"string","description":"subscriberCarrier"},"meid":{"type":"string","description":"meid"},"totalStorageSpaceInBytes":{"type":"integer","format":"int32","description":"totalStorageSpaceInBytes"},"freeStorageSpaceInBytes":{"type":"integer","format":"int32","description":"freeStorageSpaceInBytes"},"managedDeviceName":{"type":"string","description":"managedDeviceName"},"partnerReportedThreatState":{"type":"string","description":"partnerReportedThreatState"},"retireAfterDateTime":{"type":"string","description":"retireAfterDateTime"},"preferMdmOverGroupPolicyAppliedDateTime":{"type":"string","description":"preferMdmOverGroupPolicyAppliedDateTime"},"autopilotEnrolled":{"type":"boolean","description":"autopilotEnrolled"},"requireUserEnrollmentApproval":{"type":"string","description":"requireUserEnrollmentApproval"},"managementCertificateExpirationDate":{"type":"string","description":"managementCertificateExpirationDate"},"iccid":{"type":"string","description":"iccid"},"udid":{"type":"string","description":"udid"},"roleScopeTagIds":{"type":"array","items":{"type":"string"},"description":"roleScopeTagIds"},"windowsActiveMalwareCount":{"type":"integer","format":"int32","description":"windowsActiveMalwareCount"},"windowsRemediatedMalwareCount":{"type":"integer","format":"int32","description":"windowsRemediatedMalwareCount"},"notes":{"type":"string","description":"notes"},"configurationManagerClientHealthState":{"type":"string","description":"configurationManagerClientHealthState"},"configurationManagerClientInformation":{"type":"string","description":"configurationManagerClientInformation"},"ethernetMacAddress":{"type":"string","description":"ethernetMacAddress"},"physicalMemoryInBytes":{"type":"integer","format":"int32","description":"physicalMemoryInBytes"},"processorArchitecture":{"type":"string","description":"processorArchitecture"},"specificationVersion":{"type":"string","description":"specificationVersion"},"joinType":{"type":"string","description":"joinType"},"skuFamily":{"type":"string","description":"skuFamily"},"securityPatchLevel":{"type":"string","description":"securityPatchLevel"},"skuNumber":{"type":"integer","format":"int32","description":"skuNumber"},"managementFeatures":{"type":"string","description":"managementFeatures"},"enrollmentProfileName":{"type":"string","description":"enrollmentProfileName"},"bootstrapTokenEscrowed":{"type":"boolean","description":"bootstrapTokenEscrowed"},"deviceFirmwareConfigurationInterfaceManaged":{"type":"boolean","description":"deviceFirmwareConfigurationInterfaceManaged"},"hardwareInformation":{"type":"object","properties":{"serialNumber":{"type":"string","description":"serialNumber"},"totalStorageSpace":{"type":"integer","format":"int32","description":"totalStorageSpace"},"freeStorageSpace":{"type":"integer","format":"int32","description":"freeStorageSpace"},"imei":{"type":"string","description":"imei"},"meid":{"type":"string","description":"meid"},"manufacturer":{"type":"string","description":"manufacturer"},"model":{"type":"string","description":"model"},"phoneNumber":{"type":"string","description":"phoneNumber"},"subscriberCarrier":{"type":"string","description":"subscriberCarrier"},"cellularTechnology":{"type":"string","description":"cellularTechnology"},"wifiMac":{"type":"string","description":"wifiMac"},"operatingSystemLanguage":{"type":"string","description":"operatingSystemLanguage"},"isSupervised":{"type":"boolean","description":"isSupervised"},"isEncrypted":{"type":"boolean","description":"isEncrypted"},"batterySerialNumber":{"type":"string","description":"batterySerialNumber"},"batteryHealthPercentage":{"type":"integer","format":"int32","description":"batteryHealthPercentage"},"batteryChargeCycles":{"type":"integer","format":"int32","description":"batteryChargeCycles"},"isSharedDevice":{"type":"boolean","description":"isSharedDevice"},"tpmSpecificationVersion":{"type":"string","description":"tpmSpecificationVersion"},"operatingSystemEdition":{"type":"string","description":"operatingSystemEdition"},"deviceFullQualifiedDomainName":{"type":"string","description":"deviceFullQualifiedDomainName"},"deviceGuardVirtualizationBasedSecurityHardwareRequirementState":{"type":"string","description":"deviceGuardVirtualizationBasedSecurityHardwareRequirementState"},"deviceGuardVirtualizationBasedSecurityState":{"type":"string","description":"deviceGuardVirtualizationBasedSecurityState"},"deviceGuardLocalSystemAuthorityCredentialGuardState":{"type":"string","description":"deviceGuardLocalSystemAuthorityCredentialGuardState"},"osBuildNumber":{"type":"string","description":"osBuildNumber"},"operatingSystemProductType":{"type":"integer","format":"int32","description":"operatingSystemProductType"},"ipAddressV4":{"type":"string","description":"ipAddressV4"},"subnetAddress":{"type":"string","description":"subnetAddress"},"esimIdentifier":{"type":"string","description":"esimIdentifier"},"systemManagementBIOSVersion":{"type":"string","description":"systemManagementBIOSVersion"},"tpmManufacturer":{"type":"string","description":"tpmManufacturer"},"tpmVersion":{"type":"string","description":"tpmVersion"},"wiredIPv4Addresses":{"type":"array","items":{},"description":"wiredIPv4Addresses"},"batteryLevelPercentage":{"type":"string","description":"batteryLevelPercentage"},"residentUsersCount":{"type":"string","description":"residentUsersCount"},"productName":{"type":"string","description":"productName"},"deviceLicensingStatus":{"type":"string","description":"deviceLicensingStatus"},"deviceLicensingLastErrorCode":{"type":"integer","format":"int32","description":"deviceLicensingLastErrorCode"},"deviceLicensingLastErrorDescription":{"type":"string","description":"deviceLicensingLastErrorDescription"},"sharedDeviceCachedUsers":{"type":"array","items":{},"description":"sharedDeviceCachedUsers"}},"description":"hardwareInformation"},"deviceActionResults":{"type":"array","items":{"type":"object","properties":{"@odata.type":{"type":"string","description":"@odata.type"},"actionName":{"type":"string","description":"actionName"},"actionState":{"type":"string","description":"actionState"},"startDateTime":{"type":"string","description":"startDateTime"},"lastUpdatedDateTime":{"type":"string","description":"lastUpdatedDateTime"},"deviceLocation":{"type":"object","properties":{"lastCollectedDateTime":{"type":"string","description":"lastCollectedDateTime"},"longitude":{"type":"number","format":"float","description":"longitude"},"latitude":{"type":"number","format":"float","description":"latitude"},"altitude":{"type":"integer","format":"int32","description":"altitude"},"horizontalAccuracy":{"type":"integer","format":"int32","description":"horizontalAccuracy"},"verticalAccuracy":{"type":"integer","format":"int32","description":"verticalAccuracy"},"heading":{"type":"integer","format":"int32","description":"heading"},"speed":{"type":"integer","format":"int32","description":"speed"}},"description":"deviceLocation"}}},"description":"deviceActionResults"},"usersLoggedOn":{"type":"array","items":{},"description":"usersLoggedOn"},"chromeOSDeviceInfo":{"type":"array","items":{},"description":"chromeOSDeviceInfo"},"supplementalDeviceDetails":{"type":"array","items":{},"description":"supplementalDeviceDetails"},"deviceIdentityAttestationDetail":{"type":"object","properties":{"deviceIdentityAttestationStatus":{"type":"string","description":"deviceIdentityAttestationStatus"}},"description":"deviceIdentityAttestationDetail"}}}}}}}},"definitions":{},"parameters":{},"responses":{},"securityDefinitions":{"oauth2-auth":{"type":"oauth2","flow":"accessCode","authorizationUrl":"https://login.microsoftonline.com/common/oauth2/authorize","tokenUrl":"https://login.windows.net/common/oauth2/authorize","scopes":{}}},"security":[{"oauth2-auth":[]}],"tags":[]}